#лаба4-задание 2.
#Дано целое число. Если оно является положительным, то вычесть из него 8; в противном случае прибавить к нему 6. Вывести полученное число. 
print('Введите а')
a=int(input())
if a>0:
  a=a-8
else:
    a=a+6
print(a)

